# 1. Выяснить тип результата выражений:

# a = 15 * 3
# b = 15 / 3
# c = 15 // 2
# d = 15 ** 2
#
# print(type(a))
# print(type(b))
# print(type(c))
# print(type(d))

# 2. Дан список, его необходимо обработать - обособить каждое целое число кавычками
# и дополнить нулем до двух целочисленных разрядов

message = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
new_message = []     # сделал до разбора ДЗ 22.03.2022

for elem in message:     # сделал до разбора ДЗ 22.03.2022
    if elem.isdigit():     # сделал до разбора ДЗ 22.03.2022
        new_message.extend(['"', f'{int(elem):02}', '"'])
    elif (elem.startswith('+') or elem.startswith('-')) and elem[1:].isdigit():
        new_message.extend(['"', f'{elem[0]} {int(elem[1:]):02}', '"'])
    else:
        new_message.append(elem)

result = ' '.join(new_message)
print(new_message)

# 4. Дан список, содержащий искажённые данные с должностями и именами сотрудников.
# Сформировать и вывести на экран фразы вида: 'Привет, Игорь!'

# person_list = ['иненер-конструктор Игорь', 'главный бухгалтер МАРИНА',
#                'токарь высшего разряда нИКОЛАЙ', 'директор аэлита']
#
# for i in person_list:
#     correct_name = i.split()[-1].capitalize()
#     print(f'Привет, {correct_name}!')

# 5. Создать список, содержащий цены на товары (10–20 товаров). Вывести на экран эти цены через запятую в одну строку,
# цена должна отображаться в виде <r> руб <kk> коп (например «5 руб 04 коп»)

# prices = [88.5, 55.58, 3945, 16.849, 4612.88, 48.3, 15.08, 94.6, 471.88, 9415.01, 742.44, 8.5, 3, 46.99, 84.1]
# for elem in prices:
#     prices = f'{elem:.2f}'.split('.')
#     print(f'{prices[0]} руб {prices[1]} коп')

# Сортировка по возрастанию
# prices = [88.5, 55.58, 3945, 16.849, 4612.88, 48.3, 15.08, 94.6, 471.88, 9415.01, 742.44, 8.5, 3, 46.99, 84.1]
# print(id(prices))
# prices.sort()
# print(id(prices))
# for elem in prices:
#     prices = f'{elem:.2f}'.split('.')
#     print(f'{prices[0]} руб {prices[1]} коп')

# Сортировка по убыванию
# prices = [88.5, 55.58, 3945, 16.849, 4612.88, 48.3, 15.08, 94.6, 471.88, 9415.01, 742.44, 8.5, 3, 46.99, 84.1]
# prices.sort(reverse=True)
# for elem in prices:
#     prices = f'{elem:.2f}'.split('.')
#     print(f'{prices[0]} руб {prices[1]} коп')

# Сортиррвка 5 самых дорогих
# prices = [88.5, 55.58, 3945, 16.849, 4612.88, 48.3, 15.08, 94.6, 471.88, 9415.01, 742.44, 8.5, 3, 46.99, 84.1]
# for price in sorted(prices)[::-1][:5]:
#     prices = f'{price:.2f}'.split('.')
#     print(f'{prices[0]} руб {prices [1]} коп')
# Сортировку 5 самых дорогих выполнил после разбора ДЗ